tremaru/tremaru.github.io/arduino-board-index/boards/trema-1.0.2/boards.txt

##############################################################
PiranhaUNO.name=Piranha UNO
PiranhaUNO.upload.tool=arduino:avrdude
PiranhaUNO.upload.protocol=arduino
PiranhaUNO.upload.maximum_size=32256
PiranhaUNO.upload.maximum_data_size=2048
PiranhaUNO.upload.speed=115200

PiranhaUNO.bootloader.tool=arduino:avrdude
PiranhaUNO.bootloader.low_fuses=0xFF
PiranhaUNO.bootloader.high_fuses=0xDE
PiranhaUNO.bootloader.extended_fuses=0xFD
PiranhaUNO.bootloader.unlock_bits=0x3F
PiranhaUNO.bootloader.lock_bits=0x0F
PiranhaUNO.bootloader.file=optiboot/optiboot_atmega328.hex

PiranhaUNO.build.mcu=atmega328p
PiranhaUNO.build.f_cpu=16000000L
PiranhaUNO.build.board=AVR_PiranhaUNO
PiranhaUNO.build.core=arduino:arduino
PiranhaUNO.build.variant=arduino:standard
PiranhaUNO.vid.0=0x0403
PiranhaUNO.pid.0=0x6015

##############################################################

PiranhaPRO.name=Piranha Pro Mini
PiranhaPRO.upload.tool=arduino:avrdude
PiranhaPRO.upload.protocol=arduino
PiranhaPRO.upload.maximum_size=32256
PiranhaPRO.upload.maximum_data_size=2048
PiranhaPRO.upload.speed=115200

PiranhaPRO.bootloader.tool=arduino:avrdude
PiranhaPRO.bootloader.low_fuses=0xFF
PiranhaPRO.bootloader.unlock_bits=0x3F
PiranhaPRO.bootloader.lock_bits=0x0F
PiranhaPRO.bootloader.high_fuses=0xd8
PiranhaPRO.bootloader.extended_fuses=0xFD
PiranhaPRO.bootloader.file=optiboot/optiboot_atmega328-Mini.hex

PiranhaPRO.build.mcu=atmega328p
PiranhaPRO.build.f_cpu=16000000L
PiranhaPRO.build.board=AVR_PiranhaProMini
PiranhaPRO.build.core=arduino:arduino
PiranhaPRO.build.variant=arduino:standard

##############################################################

PiranhaUSBUART.name=Converter USB-UART (Piranha)
PiranhaUSBUART.vid.0=0x0403
PiranhaUSBUART.pid.0=0x6014

PiranhaUSBUART.upload.tool=arduino:avrdude
PiranhaUSBUART.upload.protocol=arduino
PiranhaUSBUART.upload.maximum_size=32256
PiranhaUSBUART.upload.maximum_data_size=2048
PiranhaUSBUART.upload.speed=115200

PiranhaPRO.bootloader.tool=arduino:avrdude
PiranhaPRO.bootloader.low_fuses=0xFF
PiranhaPRO.bootloader.unlock_bits=0x3F
PiranhaPRO.bootloader.lock_bits=0x0F
PiranhaPRO.bootloader.high_fuses=0xd8
PiranhaPRO.bootloader.extended_fuses=0xFD
PiranhaPRO.bootloader.file=optiboot/optiboot_atmega328-Mini.hex

PiranhaUSBUART.build.mcu=atmega328p
PiranhaUSBUART.build.f_cpu=16000000L
PiranhaUSBUART.build.board=PiranhaUSBUART
PiranhaUSBUART.build.core=arduino:arduino
PiranhaUSBUART.build.variant=arduino:standard


##############################################################


uino1284p.name=Piranha ULTRA

uino1284p.upload.tool=arduino:avrdude
uino1284p.upload.protocol=arduino
uino1284p.upload.maximum_size=130048
uino1284p.upload.maximum_data_size=16384
uino1284p.upload.speed=115200

uino1284p.bootloader.tool=arduino:avrdude
uino1284p.bootloader.low_fuses=0xf7
uino1284p.bootloader.high_fuses=0xde
uino1284p.bootloader.extended_fuses=0xfd
uino1284p.bootloader.file=optiboot2/optiboot_uino-1284p.hex
uino1284p.bootloader.unlock_bits=0x3F
uino1284p.bootloader.lock_bits=0x0F

uino1284p.build.mcu=atmega1284p
uino1284p.build.f_cpu=16000000L
uino1284p.build.board=AVR_PiranhaULTRA
uino1284p.build.core=arduino:arduino
uino1284p.build.variant=uino1284p
